Repository: hasbegun/ascii_smuggler
Catalog: lib/l10n/app_*.arb
Languages: es, ja, ko, zh

# appTitle
source: ASCII Smuggler
ja: ASCIIスマグラー
ko: ASCII 스머글러
zh: ASCII走私者

# appDescription
source: Convert text to invisible Unicode encodings and decode hidden secrets
es: Convierte texto a codificaciones Unicode invisibles y decodifica secretos ocultos
ja: テキストを不可視のUnicodeエンコーディングに変換し、隠された秘密を解読します
ko: 텍스트를 보이지 않는 유니코드 인코딩으로 변환하고 숨겨진 비밀을 해독합니다
zh: 将文本转换为不可见的Unicode编码并解码隐藏的秘密

# inputLabel
source: Input Text
es: Texto de Entrada
ja: 入力テキスト
ko: 입력 텍스트
zh: 输入文本

# inputHint
source: Enter text to encode or decode...
es: Ingrese texto para codificar o decodificar...
ja: エンコードまたはデコードするテキストを入力...
ko: 인코딩 또는 디코딩할 텍스트를 입력하세요...
zh: 输入要编码或解码的文本...

# encodeAndCopy
source: Encode & Copy
es: Codificar y Copiar
ja: エンコード & コピー
ko: 인코딩 & 복사
zh: 编码并复制

source: Decode
es: Decodificar
ja: デコード
ko: 디코딩
zh: 解码

source: Clear
es: Borrar
ja: クリア
ko: 지우기
zh: 清除

source: Hide Advanced Options
es: Ocultar Opciones Avanzadas
ja: 高度なオプションを非表示
ko: 고급 옵션 숨기기
zh: 隐藏高级选项

source: Toggle Advanced Options
es: Alternar Opciones Avanzadas
ja: 高度なオプション切り替え
ko: 고급 옵션 전환
zh: 切换高级选项

source: Output
es: Salida
ja: 出力
ko: 출력
zh: 输出

# containsInvisibleCharsHelper
source: Contains {count} invisible characters - Click Copy to use
es: Contiene {count} caracteres invisibles - Haga clic en Copiar para usar
ja: {count}個の不可視文字が含まれています - コピーをクリックして使用
ko: {count}개의 보이지 않는 문자 포함 - 복사를 클릭하여 사용
zh: 包含{count}个不可见字符 - 点击复制使用

# invisibleCharsDebugPlaceholder
source: [{count} invisible characters - see Debug Output below]
es: [{count} caracteres invisibles - vea la Salida de Depuración abajo]
ja: [{count}個の不可視文字 - 下のデバッグ出力を参照]
ko: [{count}개의 보이지 않는 문자 - 아래 디버그 출력 참조]
zh: [{count}个不可见字符 - 请参阅下面的调试输出]

source: Encoding Options
es: Opciones de Codificación
ja: エンコードオプション
ko: 인코딩 옵션
zh: 编码选项

source: Decoding Options
es: Opciones de Decodificación
ja: デコードオプション
ko: 디코딩 옵션
zh: 解码选项

source: Unicode Tags
es: Etiquetas Unicode
ja: Unicodeタグ
ko: 유니코드 태그
zh: Unicode标签

source: Variant Selectors
es: Selectores de Variante
ja: バリアントセレクター
ko: 변형 선택자
zh: 变体选择器

source: Add BEGIN/END Tags
es: Agregar Etiquetas BEGIN/END
ja: BEGIN/ENDタグを追加
ko: BEGIN/END 태그 추가
zh: 添加BEGIN/END标签

source: Decode URL
es: Decodificar URL
ja: URLをデコード
ko: URL 디코딩
zh: 解码URL

source: Highlight Mode
es: Modo Resaltado
ja: ハイライトモード
ko: 하이라이트 모드
zh: 高亮模式

source: Auto-decode
es: Decodificación Automática
ja: 自動デコード
ko: 자동 디코딩
zh: 自动解码

source: Show Debug
es: Mostrar Depuración
ja: デバッグ表示
ko: 디버그 표시
zh: 显示调试

source: Other Invisible
es: Otros Invisibles
ja: その他の不可視文字
ko: 기타 보이지 않는 문자
zh: 其他不可见字符

source: Input Options
es: Opciones de Entrada
ja: 入力オプション
ko: 입력 옵션
zh: 输入选项

# inputOptionsDescription
source: Click a button to copy the character to clipboard.
es: Haga clic en un botón para copiar el carácter al portapapeles.
ja: ボタンをクリックして文字をクリップボードにコピーします。
ko: 버튼을 클릭하여 문자를 클립보드에 복사합니다.
zh: 单击按钮将字符复制到剪贴板。

source: Statistics
es: Estadísticas
ja: 統計
ko: 통계
zh: 统计

source: Total
ja: 合計
ko: 전체
zh: 总计

source: Visible
ja: 可視
ko: 보이는 문자
zh: 可见

source: Invisible
ja: 不可視
ko: 보이지 않는 문자
zh: 不可见

source: Tags
es: Etiquetas
ja: タグ
ko: 태그
zh: 标签

source: Zero Width
es: Ancho Cero
ja: ゼロ幅
ko: 제로 너비
zh: 零宽度

source: Debug Output
es: Salida de Depuración
ja: デバッグ出力
ko: 디버그 출력
zh: 调试输出

source: Unicode
ko: 유니코드

source: Hexadecimal
ja: 16進数
ko: 16진수
zh: 十六进制

source: Binary
es: Binario
ja: 2進数
ko: 2진수
zh: 二进制

# debugHint
source: Character codes will appear here...
es: Los códigos de caracteres aparecerán aquí...
ja: 文字コードがここに表示されます...
ko: 문자 코드가 여기에 표시됩니다...
zh: 字符代码将显示在这里...

source: About ASCII Smuggler
es: Acerca de ASCII Smuggler
ja: ASCIIスマグラーについて
ko: ASCII 스머글러 정보
zh: 关于ASCII走私者

# aboutDescription
source: ASCII Smuggler converts text to invisible Unicode encodings and decodes hidden secrets.
es: ASCII Smuggler convierte texto a codificaciones Unicode invisibles y decodifica secretos ocultos.
ja: ASCIIスマグラーはテキストを不可視のUnicodeエンコーディングに変換し、隠された秘密を解読します。
ko: ASCII 스머글러는 텍스트를 보이지 않는 유니코드 인코딩으로 변환하고 숨겨진 비밀을 해독합니다.
zh: ASCII走私者将文本转换为不可见的Unicode编码并解码隐藏的秘密。

source: Encoding Methods:
es: Métodos de Codificación:
ja: エンコード方式：
ko: 인코딩 방법:
zh: 编码方法：

# unicodeTagsDescription
source: • Unicode Tags: Uses invisible tag characters (U+E0000 block)
es: • Etiquetas Unicode: Usa caracteres de etiqueta invisibles (bloque U+E0000)
ja: • Unicodeタグ：不可視タグ文字を使用（U+E0000ブロック）
ko: • 유니코드 태그: 보이지 않는 태그 문자 사용 (U+E0000 블록)
zh: • Unicode标签：使用不可见标签字符（U+E0000块）

# variantSelectorsDescription
source: • Variant Selectors: Adds variant selector characters
es: • Selectores de Variante: Agrega caracteres selectores de variante
ja: • バリアントセレクター：バリアントセレクター文字を追加
ko: • 변형 선택자: 변형 선택자 문자 추가
zh: • 变体选择器：添加变体选择器字符

# sneakyBitsDescription
source: • Sneaky Bits: Binary encoding with zero-width characters
es: • Bits Furtivos: Codificación binaria con caracteres de ancho cero
ja: • Sneaky Bits：ゼロ幅文字を使用したバイナリエンコード
ko: • Sneaky Bits: 제로 너비 문자를 사용한 바이너리 인코딩
zh: • Sneaky Bits：使用零宽度字符的二进制编码

source: Use Cases:
es: Casos de Uso:
ja: 使用例：
ko: 사용 사례:
zh: 使用案例：

# useCaseSecurityResearch
source: • Security research
es: • Investigación de seguridad
ja: • セキュリティ研究
ko: • 보안 연구
zh: • 安全研究

# useCaseSteganography
source: • Steganography demonstrations
es: • Demostraciones de esteganografía
ja: • ステガノグラフィーのデモンストレーション
ko: • 스테가노그래피 시연
zh: • 隐写术演示

# useCaseUnicodeEncoding
source: • Understanding Unicode encoding
es: • Comprensión de codificación Unicode
ja: • Unicodeエンコーディングの理解
ko: • 유니코드 인코딩 이해
zh: • 理解Unicode编码

source: Close
es: Cerrar
ja: 閉じる
ko: 닫기
zh: 关闭

source: About
es: Acerca de
ja: について
ko: 정보
zh: 关于

source: Please enter text to encode
es: Por favor ingrese texto para codificar
ja: エンコードするテキストを入力してください
ko: 인코딩할 텍스트를 입력하세요
zh: 请输入要编码的文本

source: Please enter text to decode
es: Por favor ingrese texto para decodificar
ja: デコードするテキストを入力してください
ko: 디코딩할 텍스트를 입력하세요
zh: 请输入要解码的文本

source: Text copied to clipboard!
es: ¡Texto copiado al portapapeles!
ja: テキストがクリップボードにコピーされました！
ko: 텍스트가 클립보드에 복사되었습니다!
zh: 文本已复制到剪贴板！

source: No hidden text detected
es: No se detectó texto oculto
ja: 隠しテキストは検出されませんでした
ko: 숨겨진 텍스트가 감지되지 않았습니다
zh: 未检测到隐藏文本

source: No hidden text found
es: No se encontró texto oculto
ja: 隠しテキストが見つかりません
ko: 숨겨진 텍스트를 찾을 수 없습니다
zh: 未找到隐藏文本

# detectedHiddenText
source: Detected hidden text:\n
es: Texto oculto detectado:\n
ja: 検出された隠しテキスト：\n
ko: 감지된 숨겨진 텍스트:\n
zh: 检测到的隐藏文本：\n

# decodedMessages
source: Decoded {count} hidden message(s)
es: Decodificados {count} mensaje(s) oculto(s)
ja: {count}個の隠しメッセージをデコードしました
ko: {count}개의 숨겨진 메시지를 디코딩했습니다
zh: 已解码{count}条隐藏消息

source: Cleared
es: Borrado
ja: クリアされました
ko: 지워졌습니다
zh: 已清除

# copiedToClipboard
source: Copied {label} to clipboard
es: {label} copiado al portapapeles
ja: {label}をクリップボードにコピーしました
ko: {label}을(를) 클립보드에 복사했습니다
zh: 已将{label}复制到剪贴板

source: Sneaky Bits (UTF-8)
es: Bits Furtivos (UTF-8)

source: Sneaky Bits
es: Bits Furtivos
